{"data": [{"pair_id": "028f648315854dcbb47c4e3c40c6d352", "topic": "House Ways And Means Committee Seeks Trump Tax Returns", "date": "2019-04-04", "article_a": "House Committee Seeks Trump Tax Returns from IRS", "article_b": "OPINION: Congress wants to reveal Trump's biggest secret", "claim_a": "It was the third time this week a Democratic-led House committee exerted oversight pressure on Trump.", "claim_b": "Neal's gambit now puts Charles Rettig, the current IRS commissioner, who was nominated by Trump and confirmed by the Senate, in a delicate political position.", "relation": 1, "rationale": ["third time this week a Democratic-led House committee exerted oversight pressure on Trump."], "rationale_ba": ["Neal's gambit", "current IRS commissioner, who was nominated by Trump", "in a delicate political position."]}, {"pair_id": "79e5a19acfdd4788ae8e643ed98f6493", "topic": "President Biden Faces Challenges After Infrastructure Win", "date": "2021-11-08", "article_a": "Biden faces fresh challenges after infrastructure victory", "article_b": "Biden’s budget bill threatened by Democratic infighting after infrastructure win", "claim_a": "But the legislative win sets up a series of challenges for Biden, both in promoting the new deal and at the same time continuing to push for a long-argued-over $1.85 trillion social safety net and climate bill, which would dramatically expand health, family and climate change programs.", "claim_b": "Mr. Gottheimer said he would be comfortable voting for the package provided the $1.75 trillion figure was accurate and the bill did not add to the deficit.", "relation": 1, "rationale": ["sets up a series of challenges for Biden,", "long-argued-over $1.85 trillion social safety net and climate bill,"], "rationale_ba": ["would be comfortable voting for the package", "$1.75 trillion figure was accurate and the bill did not add to the deficit."]}, {"pair_id": "844e5d45c7f6409ab264a987df23d95d", "topic": "Senators to Hear Opening Arguments in Second Trump Impeachment Trial", "date": "2021-02-10", "article_a": "Democrats to argue Trump alone incited mob", "article_b": "Dems set to prosecute case at Trump impeachment trial amid speculation over which Republicans might convict", "claim_a": "House Democrats will begin two days of arguments in Donald Trump's second impeachment trial, trying to convince skeptical Republicans that the former president alone was responsible for inciting his mob of supporters who broke into the U.S. Capitol on Jan. 6 and interrupted the presidential electoral count.", "claim_b": "That's bolstered by the fact McConnell and 43 other Republicans voted Tuesday that the impeachment trial is unconstitutional.", "relation": 1,  "rationale": ["House Democrats will begin two days of arguments in Donald Trump's second impeachment trial,", "skeptical Republicans that the former president alone was responsible for inciting his mob of supporters"], "rationale_ba": ["43 other Republicans voted Tuesday that the impeachment trial is unconstitutional."]}], "version": "2.0"}